CVACT02B DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,TIOAPFX=YES
MAP1     DFHMDI SIZE=(24,80)
CUSTID   DFHMDF POS=(5,10),LENGTH=10,ATTRB=NUM
FNAME    DFHMDF POS=(6,10),LENGTH=20,ATTRB=ALPHA
LNAME    DFHMDF POS=(7,10),LENGTH=20,ATTRB=ALPHA
         DFHMSD TYPE=FINAL
         END
